act
aws-elasticbeanstalk
aws-sam-cli
bat
btop
cmake
cocoapods
deno
diff-so-fancy
docker
docker-compose
doctl
ffmpeg
fnm
foreman
fzf
gcc
gdbm
gdrive
gh
git
go
helix
jesseduffield/lazygit/lazygit
jq
lazydocker
libev
livekit
llvm@17
localstack/tap/localstack-cli
mvfst
neofetch
neovim
openssl@1.1
pipx
pnpm
portaudio
protobuf
pyenv
ranger
rbenv-default-gems
rbenv-gemset
ripgrep
ruff
rust
rustup
sbt
scala
sox
speedtest-cli
sst/tap/sst
stripe/stripe-cli/stripe
supabase/tap/supabase
tmux
ubuntu/microk8s/microk8s
watchman
wget
yarn
z
zig
