act
aws-elasticbeanstalk
aws-sam-cli
bat
btop
cmake
cocoapods
deno
diff-so-fancy
docker
docker-compose
doctl
dotnet
dotnet@8
ffmpeg
fnm
foreman
fping
fzf
gcc
gdbm
gdrive
gh
ghostty
git
go
graphviz
helix
htop
jesseduffield/lazygit/lazygit
jq
lazydocker
libev
livekit
llvm@17
localstack/tap/localstack-cli
mvfst
neofetch
neovim
openssl@1.1
oven-sh/bun/bun
pipx
pnpm
portaudio
postgresql@15
protobuf
pyenv
ranger
rbenv-default-gems
rbenv-gemset
ripgrep
ruff
sbt
scala
sox
speedtest-cli
sst/tap/sst
stripe/stripe-cli/stripe
supabase/tap/supabase
tmux
ubuntu/microk8s/microk8s
uv
watchman
wget
yarn
yq
z
1password-cli
alfred
bruno
caffeine
dropbox
flux
jordanbaird-ice
mactex
multipass
nextcloud
orbstack
rectangle
stats
sublime-text
superduper
transmission
vlc
wezterm
zed
zotero
